//

// -> EXCEL

// <- EXCEL

// =>
// Задача 1.
// Створити модальне вікно яке буде відкриватися
// при кліку на кнопку всередині тега body
// Модальне вікно має закриватися при кліку на напівпрозорий оверлей,
// та на іконку хрестика всередині модалки

// =>
// Задача 2.
// Додати в модальне вікно логіку закриття
// при натисканні на кнопку "Escape"

// =>
// Задача 3.
// Створити форму реєстрації в модалці користувача за допомогою js,
// де буде 2 поля:
//   1. Поле логіна
//   2. Поле пароль
// Захаркодити вірні логін і пароль в константах
// Додати логіку сабміта форми, при сабміті перевіряємо введені логін і пароль.
// Умови:
//   1. Якщо логін і пароль співпадають,
//     то видаляємо форму з документа і показуємо h2 з написом "Вхід успішний"
//   2. Якщо логін і пароль не співпадають з даними з констант,
//      то показуємо під формою помилку червоним кольором “Логін або пароль не вірні”
